linearregression_pipeline.org
#+title: ML Pipeline (sklearn, mongo, quandl, airflow)
#+autor: Jeffery Scully
#+PROPERTY: header-args :tangle sntdex.py
#+STARTUP: showeverything

Quandl api key - 6UfyTfL7MDo26ypfYzVd
Include pydoc
Include pip freeze output
Include try blocks

* Train LinearRegression Model


  Using Quandl, an API that provides stock price data. The python libarary returns a pandas dataframe.

  Getting Data for Google stock prices from DATE - DATE. Will train model using LinearRegression, and use it to predict future stock prices.

  Data:
  Open:
  High:
  Low:
  Close:
  Volume:
  Ex-Dividend:
  Split Ratio:
  Adj. Open:
  Adj. High:
  Adj. Low:
  Adj. Close:
  Adj. Volume:

* Define Variables
** DB table column - HL_PCT
** DB table column - PCT_change
   - This is the percent change of closing price verses the opening opening price
     
#+begin_export latex
PCT\_change = \frac{Closing\_Price - Opening\_Price}{Opening\_Price} \times 100
#+end_export
     
  
** Python Variable - X
** Python Variable - X_lately
** Python Variable - y
** Python Variable - X_train
** Python Variable - y_train
** Python Variable - X_test
** Python Variable - y_test

  
* How LinearRegression Works 
* Save Model, using Pickle
* Create 
