linearregression_pipeline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-17 Thu 15:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ML Pipeline (sklearn, mongo, quandl, airflow)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jeffery Scully" />
</head>
<body>
<div id="content">
<h1 class="title">ML Pipeline (sklearn, mongo, quandl, airflow)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdcdf445">1. Train LinearRegression Model</a></li>
<li><a href="#orgc866276">2. Define Variables</a>
<ul>
<li><a href="#orgfabf914">2.1. DB table column - HL<sub>PCT</sub></a></li>
<li><a href="#orgd029f28">2.2. DB table column - PCT<sub>change</sub></a></li>
<li><a href="#org7a39267">2.3. Python Variable - X</a></li>
<li><a href="#org4f111c6">2.4. Python Variable - X<sub>lately</sub></a></li>
<li><a href="#org761f955">2.5. Python Variable - y</a></li>
<li><a href="#org2ad709a">2.6. Python Variable - X<sub>train</sub></a></li>
<li><a href="#org6407290">2.7. Python Variable - y<sub>train</sub></a></li>
<li><a href="#org068bce3">2.8. Python Variable - X<sub>test</sub></a></li>
<li><a href="#orgcb9dd92">2.9. Python Variable - y<sub>test</sub></a></li>
</ul>
</li>
<li><a href="#org90e68ef">3. How LinearRegression Works</a></li>
<li><a href="#org7871b66">4. Save Model, using Pickle</a></li>
<li><a href="#orgb1ebfe1">5. Create</a></li>
</ul>
</div>
</div>
<p>
Quandl api key - 6UfyTfL7MDo26ypfYzVd
Include pydoc
Include pip freeze output
Include try blocks
</p>

<div id="outline-container-orgdcdf445" class="outline-2">
<h2 id="orgdcdf445"><span class="section-number-2">1.</span> Train LinearRegression Model</h2>
<div class="outline-text-2" id="text-1">
<p>
Using Quandl, an API that provides stock price data. The python libarary returns a pandas dataframe.
</p>

<p>
Getting Data for Google stock prices from DATE - DATE. Will train model using LinearRegression, and use it to predict future stock prices.
</p>

<p>
Data:
Open:
High:
Low:
Close:
Volume:
Ex-Dividend:
Split Ratio:
Adj. Open:
Adj. High:
Adj. Low:
Adj. Close:
Adj. Volume:
</p>
</div>
</div>

<div id="outline-container-orgc866276" class="outline-2">
<h2 id="orgc866276"><span class="section-number-2">2.</span> Define Variables</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfabf914" class="outline-3">
<h3 id="orgfabf914"><span class="section-number-3">2.1.</span> DB table column - HL<sub>PCT</sub></h3>
</div>
<div id="outline-container-orgd029f28" class="outline-3">
<h3 id="orgd029f28"><span class="section-number-3">2.2.</span> DB table column - PCT<sub>change</sub></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>This is the percent change of closing price verses the opening opening price</li>
</ul>


<p>
\(PCT\_change = \frac{Closing\_Price - Opening\_Price}{Opening\_Price} \times 100\)
</p>
</div>
</div>


<div id="outline-container-org7a39267" class="outline-3">
<h3 id="org7a39267"><span class="section-number-3">2.3.</span> Python Variable - X</h3>
</div>
<div id="outline-container-org4f111c6" class="outline-3">
<h3 id="org4f111c6"><span class="section-number-3">2.4.</span> Python Variable - X<sub>lately</sub></h3>
</div>
<div id="outline-container-org761f955" class="outline-3">
<h3 id="org761f955"><span class="section-number-3">2.5.</span> Python Variable - y</h3>
</div>
<div id="outline-container-org2ad709a" class="outline-3">
<h3 id="org2ad709a"><span class="section-number-3">2.6.</span> Python Variable - X<sub>train</sub></h3>
</div>
<div id="outline-container-org6407290" class="outline-3">
<h3 id="org6407290"><span class="section-number-3">2.7.</span> Python Variable - y<sub>train</sub></h3>
</div>
<div id="outline-container-org068bce3" class="outline-3">
<h3 id="org068bce3"><span class="section-number-3">2.8.</span> Python Variable - X<sub>test</sub></h3>
</div>
<div id="outline-container-orgcb9dd92" class="outline-3">
<h3 id="orgcb9dd92"><span class="section-number-3">2.9.</span> Python Variable - y<sub>test</sub></h3>
</div>
</div>


<div id="outline-container-org90e68ef" class="outline-2">
<h2 id="org90e68ef"><span class="section-number-2">3.</span> How LinearRegression Works</h2>
</div>
<div id="outline-container-org7871b66" class="outline-2">
<h2 id="org7871b66"><span class="section-number-2">4.</span> Save Model, using Pickle</h2>
</div>
<div id="outline-container-orgb1ebfe1" class="outline-2">
<h2 id="orgb1ebfe1"><span class="section-number-2">5.</span> Create</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jeffery Scully</p>
<p class="date">Created: 2021-06-17 Thu 15:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
